_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
# I am editing this notebook in a local environment and already have the dataset
# !wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

In [2]:
# I am editing this notebook in a local environment and already have the dataset
# !tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

In [3]:
%cd instacart_2017_05_01

/Users/Tobias/workshop/dasci/sprints/02-Data_Wrangling_and_Storytelling/code/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r--@ 1 Tobias  staff   2.5K May  2  2017 aisles.csv
-rw-r--r--@ 1 Tobias  staff   270B May  2  2017 departments.csv
-rw-r--r--@ 1 Tobias  staff   551M May  2  2017 order_products__prior.csv
-rw-r--r--@ 1 Tobias  staff    24M May  2  2017 order_products__train.csv
-rw-r--r--@ 1 Tobias  staff   104M May  2  2017 orders.csv
-rw-r--r--@ 1 Tobias  staff   2.1M May  2  2017 products.csv

In [5]:
import pandas as pd

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

---

The columns I will need:

- Product name / id
- Product order quantity

In [6]:
# Go through the csv files to find those columns
# Starting with products
products = pd.read_csv("products.csv")
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

The `products.csv` file has the name of the product. I can join this to another dataset via the `product_id`.

In [7]:
# Next, I would assume that orders.csv has the product amount
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

Looks like `orders.csv` does not have the quantity of product ordered.

In [8]:
# Reading in order_products__prior.csv to get quantity of each product on each order
order_products__prior = pd.read_csv("order_products__prior.csv")
print(order_products__prior.shape)
order_products__prior.head(16)

(32434489, 4)

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
1          2       28985                  2          1
2          2        9327                  3          0
3          2       45918                  4          1
4          2       30035                  5          0
5          2       17794                  6          1
6          2       40141                  7          1
7          2        1819                  8          1
8          2       43668                  9          0
9          3       33754                  1          1
10         3       24838                  2          1
11         3       17704                  3          1
12         3       21903                  4          1
13         3       17668                  5          1
14         3       46667                  6          1
15         3       17461                  7          1

I believe I can get the data I want by joining `products.csv` and `order_products__prior.csv` on the `product_id` column.

First, I need to concatenate `order_products__prior` and `order_products__train`.

In [9]:
# Load in order_products__train.csv
order_products__train = pd.read_csv("order_products__train.csv")
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [10]:
# Concatenate the two order_products datasets
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
# Assertion to be sure the two add up
assert (order_products__prior.shape[0] + order_products__train.shape[0] == order_products.shape[0])

It does not look like the data shows how many of each product was purchased. It shows what product was added to which order, and the time of the order.

In [12]:
# Merge the products data with the order_products data
products_ordered_merged = pd.merge(order_products[["order_id", "product_id"]], products[["product_id", "product_name"]], how="inner", on="product_id")
print(products_ordered_merged.shape)
products_ordered_merged.head(16)

(33819106, 3)

    order_id  product_id        product_name
0          2       33120  Organic Egg Whites
1         26       33120  Organic Egg Whites
2        120       33120  Organic Egg Whites
3        327       33120  Organic Egg Whites
4        390       33120  Organic Egg Whites
5        537       33120  Organic Egg Whites
6        582       33120  Organic Egg Whites
7        608       33120  Organic Egg Whites
8        623       33120  Organic Egg Whites
9        689       33120  Organic Egg Whites
10       726       33120  Organic Egg Whites
11       771       33120  Organic Egg Whites
12       800       33120  Organic Egg Whites
13       901       33120  Organic Egg Whites
14      1005       33120  Organic Egg Whites
15      1097       33120  Organic Egg Whites

In [13]:
# Now I can use the .value_counts() chained with .nlargest(10) methods to get the top 10 ordered products
products_top10 = products_ordered_merged["product_name"].value_counts().nlargest(10)
products_top10

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

---

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

---

### Replicate the Lesson Code

In [14]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [15]:
index = ["Captain Barbossa", "Jack Sparrow", "Will Turner"]
columns = ["islanda", "islandb"]

table1 = pd.DataFrame([[np.nan, 2],
                      [16, 11],
                      [3, 1]],
                     index=index,
                     columns=columns)

table2 = table1.T

In [16]:
table1

                  islanda  islandb
Captain Barbossa      NaN        2
Jack Sparrow         16.0       11
Will Turner           3.0        1

In [17]:
table2

         Captain Barbossa  Jack Sparrow  Will Turner
islanda               NaN          16.0          3.0
islandb               2.0          11.0          1.0

#### Tidying Up: Table1

In [18]:
# Make the index (currently the names) a column
table1 = table1.reset_index()
table1

              index  islanda  islandb
0  Captain Barbossa      NaN        2
1      Jack Sparrow     16.0       11
2       Will Turner      3.0        1

In [19]:
# Use pd.melt() to reshape the table into Tidy format
tidy_table1 = table1.melt(id_vars="index", value_vars=["islanda", "islandb"])
tidy_table1

              index variable  value
0  Captain Barbossa  islanda    NaN
1      Jack Sparrow  islanda   16.0
2       Will Turner  islanda    3.0
3  Captain Barbossa  islandb    2.0
4      Jack Sparrow  islandb   11.0
5       Will Turner  islandb    1.0

In [20]:
# Rename the columns into something useful
tidy_columns = {
    "index": "name",
    "variable": "island",
    "value": "days_marooned",
}

tidy_table1_named = tidy_table1.rename(columns=tidy_columns)

tidy_table1_named

               name   island  days_marooned
0  Captain Barbossa  islanda            NaN
1      Jack Sparrow  islanda           16.0
2       Will Turner  islanda            3.0
3  Captain Barbossa  islandb            2.0
4      Jack Sparrow  islandb           11.0
5       Will Turner  islandb            1.0

In [21]:
# Clean up "island" column to remove the extra text
tidy_table1_named["island"] = tidy_table1_named["island"].str.replace("island", "")
tidy_table1_named

               name island  days_marooned
0  Captain Barbossa      a            NaN
1      Jack Sparrow      a           16.0
2       Will Turner      a            3.0
3  Captain Barbossa      b            2.0
4      Jack Sparrow      b           11.0
5       Will Turner      b            1.0

---

#### Tidying Up: Table2

In [22]:
# Take a look at the table
table2

         Captain Barbossa  Jack Sparrow  Will Turner
islanda               NaN          16.0          3.0
islandb               2.0          11.0          1.0

In [23]:
# Make the index (currently the islands) a column
table2 = table2.reset_index()
table2

     index  Captain Barbossa  Jack Sparrow  Will Turner
0  islanda               NaN          16.0          3.0
1  islandb               2.0          11.0          1.0

In [24]:
# Use pd.melt() to reshape into a tidy table (I like being organized)
value_columns = [
    "Captain Barbossa",
    "Jack Sparrow",
    "Will Turner",
]

tidy_table2 = table2.melt(id_vars="index", value_vars=value_columns)

tidy_table2

     index          variable  value
0  islanda  Captain Barbossa    NaN
1  islandb  Captain Barbossa    2.0
2  islanda      Jack Sparrow   16.0
3  islandb      Jack Sparrow   11.0
4  islanda       Will Turner    3.0
5  islandb       Will Turner    1.0

In [25]:
# Rename the columns so they're a bit more informative
tidy2_columns = {
    "index": "island",
    "variable": "name",
    "value": "days_marooned",
}

tidy_table2_named = tidy_table2.rename(columns=tidy2_columns)

tidy_table2_named

    island              name  days_marooned
0  islanda  Captain Barbossa            NaN
1  islandb  Captain Barbossa            2.0
2  islanda      Jack Sparrow           16.0
3  islandb      Jack Sparrow           11.0
4  islanda       Will Turner            3.0
5  islandb       Will Turner            1.0

In [26]:
# Remove redundant "island" from the "island" column
# Now that it's named "island", no need for the "island" in each cell
tidy_table2_named["island"] = tidy_table2_named["island"].str.replace("island", "")
tidy_table2_named

  island              name  days_marooned
0      a  Captain Barbossa            NaN
1      b  Captain Barbossa            2.0
2      a      Jack Sparrow           16.0
3      b      Jack Sparrow           11.0
4      a       Will Turner            3.0
5      b       Will Turner            1.0

---

#### De-Tidying: Table1

In [27]:
wide_table1 = tidy_table1_named.pivot_table(index="name", columns="island", values="days_marooned")
wide_table1

island               a     b
name
Captain Barbossa   NaN   2.0
Jack Sparrow      16.0  11.0
Will Turner        3.0   1.0

---

#### De-Tidying: Table2

In [28]:
wide_table2 = tidy_table2_named.pivot_table(index="island", columns="name", values="days_marooned")
wide_table2

name    Captain Barbossa  Jack Sparrow  Will Turner
island
a                    NaN          16.0          3.0
b                    2.0          11.0          1.0

---

- Load seaborn's `flights` dataset by running the cell below.
- Then create a pivot table showing the number of passengers by month and year.
    - Use year for the index and month for the columns. 
    - You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [29]:
# Load the seaborn "flights" dataset
flights = sns.load_dataset('flights')

In [30]:
# Check out the data
print(flights.shape)
flights.head(8)

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121
5  1949      June         135
6  1949      July         148
7  1949    August         148

In [31]:
# Create pivot table with year as index and month as column
flights_table = flights.pivot_table(index="year", columns="month", values="passengers")
flights_table

month,January,February,March,April,May,June,July,August,September,October,November,December
year,,,,,,,,,,,,
1949,112,118,132,129,121,135,148,148,136,119,104,118
1950,115,126,141,135,125,149,170,170,158,133,114,140
1951,145,150,178,163,172,178,199,199,184,162,146,166
1952,171,180,193,181,183,218,230,242,209,191,172,194
1953,196,196,236,235,229,243,264,272,237,211,180,201
1954,204,188,235,227,234,264,302,293,259,229,203,229
1955,242,233,267,269,270,315,364,347,312,274,237,278
1956,284,277,317,313,318,374,413,405,355,306,271,306
1957,315,301,356,348,355,422,465,467,404,347,305,336
1958,340,318,362,348,363,435,491,505,404,359,310,337
1959,360,342,406,396,420,472,548,559,463,407,362,405
1960,417,391,419,461,472,535,622,606,508,461,390,432

Can confirm:

- Jan 1949 has 112 passengers
- Dec 1960 has 432 passengers

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

---

#### Latest Ordered Popular Products

In order to get the most popular products in the latest part of the day, I'll need to make some sort of table that sorts the .value_count() of orders by time of day.

In [32]:
# take a look at the orders dataset
print(orders.shape)
orders.head()
# I'll need from this dataset:
# order_id, order_hour_of_day

(3421083, 7)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [33]:
# And at the order_products concatenated dataset from earlier
print(order_products.shape)
order_products.head()
# I'll need this dataset to connect the products and orders datasets. Thus, I'll need:
# order_id, product_id

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [34]:
# Now looking at the products dataset
print(products.shape)
products.head()
# From this dataset, I'll need:
# product_id, product_name

(49688, 4)

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

Columns needed:

- products
    - product_id
    - product_name (for display purposes)
- order_products
    - order_id
    - product_id
- orders
    - order_id
    - order_hour_of_day

In [35]:
# Now to join the three datasets
orders_products_orderproducts_merged = (orders[["order_id", "order_hour_of_day"]]
                                       .merge(order_products[["order_id", "product_id"]])
                                       .merge(products[["product_id", "product_name"]]))

orders_products_orderproducts_merged

,order_id,order_hour_of_day,product_id,product_name
0,2539329,8,196,Soda
1,2398795,7,196,Soda
2,473747,12,196,Soda
3,2254736,7,196,Soda
4,431534,15,196,Soda
5,3367565,7,196,Soda
6,550135,9,196,Soda
7,3108588,14,196,Soda
8,2295261,16,196,Soda
9,2550362,8,196,Soda
10,1187899,8,196,Soda
11,2968173,9,196,Soda
12,1870022,16,196,Soda
13,1911383,11,196,Soda
14,2715276,9,196,Soda
15,487368,10,196,Soda
16,2293453,14,196,Soda
17,1973799,12,196,Soda
18,532817,17,196,Soda
19,1573906,10,196,Soda
20,1593000,8,196,Soda
21,2231262,11,196,Soda
22,2580647,16,196,Soda
23,2187180,12,196,Soda
24,2497897,9,196,Soda
25,1318871,10,196,Soda
26,1261384,10,196,Soda
27,580568,10,196,Soda
28,2428073,7,196,Soda
29,342306,11,196,Soda
...,...,...,...,...
33819076,131322,14,19259,Florentine Spinach and Cheese Pasta Sauce
33819077,2990238,13,40747,Whitening Plus Scope Crest Complete Multi-Bene...
33819078,3294485,16,40747,Whitening Plus Scope Crest Complete Multi-Bene...
33819079,2706073,11,45378,Miss Treated Conditioner
33819080,346319,16,35952,Peachtree Schnapps
33819081,828012,7,48343,Hennepin Farmhouse Ale
33819082,2608655,15,9818,Cld/Flu Van Chrry
33819083,3004721,20,44495,Lowfat Cherry Lime Supernova Kefir Cultured Mi...
33819084,2216423,16,29713,18 Year Scotch Whisky
33819085,136517,13,29713,18 Year Scotch Whisky
33819086,461844,11,15408,Training Fluoride Free Toothpaste Apple & Ban...
33819087,216145,14,15408,Training Fluoride Free Toothpaste Apple & Ban...
33819088,2941852,15,8682,All Purpose Eraser
33819089,2321285,10,8682,All Purpose Eraser
33819090,609055,13,43553,Orange Energy Shots
33819091,1928449,9,43553,Orange Energy Shots
33819092,2222639,9,43553,Orange Energy Shots
33819093,339942,10,43553,Orange Energy Shots
33819094,2798193,13,43553,Orange Energy Shots
33819095,2391791,6,43553,Orange Energy Shots
33819096,576295,10,43553,Orange Energy Shots
33819097,960088,12,43553,Orange Energy Shots
33819098,343962,10,43553,Orange Energy Shots
33819099,2329472,12,43553,Orange Energy Shots
33819100,694731,14,43553,Orange Energy Shots
33819101,1320836,15,43553,Orange Energy Shots
33819102,31526,11,43553,Orange Energy Shots
33819103,758936,7,42338,"Zucchini Chips, Pesto"
33819104,2745165,5,42338,"Zucchini Chips, Pesto"
33819105,3093936,14,28818,Hot Oatmeal Multigrain Raisin

In [36]:
# Filter the dataset based on popular: > 2700 orders
# First, get a list of the popular products
product_counts = orders_products_orderproducts_merged["product_name"].value_counts()

In [37]:
# take a look to see
product_counts

Banana                                  491291
Bag of Organic Bananas                  394930
Organic Strawberries                    275577
Organic Baby Spinach                    251705
Organic Hass Avocado                    220877
                                         ...
Orange Recharge                              1
Brut Prosecco                                1
Orangemint Flavored Water                    1
Greek Blended Cherry Fat Free Yogurt         1
The Ultimate Caramel Suace                   1
Name: product_name, Length: 49685, dtype: int64

In [38]:
print(type(product_counts))

<class 'pandas.core.series.Series'>

In [39]:
# Keep only the products with more than 2700 orders
popular_products_count = product_counts[product_counts > 2700]
popular_products_count

Banana                                  491291
Bag of Organic Bananas                  394930
Organic Strawberries                    275577
Organic Baby Spinach                    251705
Organic Hass Avocado                    220877
                                         ...
Meyer Lemons                              2712
Organic Popcorn                           2706
Snacks Mango                              2705
Organic Go Go Apple Peach Applesauce      2705
Yogurt Tubes Blueberry                    2705
Name: product_name, Length: 2210, dtype: int64

In [40]:
print(popular_products_count.shape)  # That reduces the number of products by a lot!

(2210,)

In [51]:
# Now I'll need to get a list of those products, and use it to filter the main dataset
pop_products_list = popular_products_count.tolist()
print(len(pop_products_list))

2210

In [49]:
# Got the list; time to filter based on it
# First - add the boolean result of .isin() as a new column
orders_products_orderproducts_merged["popular"] = orders_products_orderproducts_merged["product_id"].isin(pop_products_list)
orders_products_orderproducts_merged.head(16)

    order_id  order_hour_of_day  product_id product_name  popular
0    2539329                  8         196         Soda    False
1    2398795                  7         196         Soda    False
2     473747                 12         196         Soda    False
3    2254736                  7         196         Soda    False
4     431534                 15         196         Soda    False
5    3367565                  7         196         Soda    False
6     550135                  9         196         Soda    False
7    3108588                 14         196         Soda    False
8    2295261                 16         196         Soda    False
9    2550362                  8         196         Soda    False
10   1187899                  8         196         Soda    False
11   2968173                  9         196         Soda    False
12   1870022                 16         196         Soda    False
13   1911383                 11         196         Soda    False
14   2715276                  9         196         Soda    False
15    487368                 10         196         Soda    False

In [50]:
orders_products_orderproducts_merged["popular"].value_counts()

False    32800251
True      1018855
Name: popular, dtype: int64

In [52]:
# Filter based on the "popular" column
popular_products_orders = orders_products_orderproducts_merged[orders_products_orderproducts_merged["popular"] == True]
print(popular_products_orders.shape)
popular_products_orders.head(8)

(1018855, 5)

,order_id,order_hour_of_day,product_id,product_name,popular
1579209,1501582,10,8479,Original Black Box Tablewater Cracker,True
1579210,2644515,19,8479,Original Black Box Tablewater Cracker,True
1579211,495013,10,8479,Original Black Box Tablewater Cracker,True
1579212,2507322,17,8479,Original Black Box Tablewater Cracker,True
1579213,1988164,15,8479,Original Black Box Tablewater Cracker,True
1579214,382106,8,8479,Original Black Box Tablewater Cracker,True
1579215,401236,11,8479,Original Black Box Tablewater Cracker,True
1579216,270127,18,8479,Original Black Box Tablewater Cracker,True

In [60]:
# I'm wondering if it would work to use the mode as the representative hour for each product
# i.e. I want to get the mode (and mean, while I'm at it?) order_hour_of_day for each product in popular_products_orders
pop_products_mean_hour = popular_products_orders["order_hour_of_day"].groupby([popular_products_orders["product_name"]]).mean()
pop_products_mean_hour

product_name
0% Fat Blueberry Greek Yogurt                                                         12.856618
1 Liter                                                                               13.696120
10 Tostada Shells                                                                     12.545455
100% Beeswax Hand Dipped Tapers                                                       12.400000
100% Florida Orange Juice                                                             13.290070
                                                                                        ...
flings! Original Laundry Detergent Pacs                                               13.583333
for All Mouth Sores Fresh Mint Oral Debriding Agent/Antiseptic Rinse/Pain Reliever    14.187500
iChef Casserole Pans with Lids (10 7/16 in x 8 in x 1 3/4 in)                         12.928571
o.b Super Plus Fluid Lock Tampons                                                     12.820000
vitaminwater XXX Acai Blueberry Pomegranate                                          13.495119
Name: order_hour_of_day, Length: 1850, dtype: float64

In [62]:
print(type(pop_products_mean_hour))  # If I can combine this with the value_counts() of the products then I'll have something pretty useful

<class 'pandas.core.series.Series'>

In [65]:
# Checking out what the result is when using median instead of mean
# (Errors out when trying to calculate the mode in the same way)
pop_products_median_hour = popular_products_orders["order_hour_of_day"].groupby([popular_products_orders["product_name"]]).median()
pop_products_median_hour  # The results look very similar

product_name
0% Fat Blueberry Greek Yogurt                                                         13.0
1 Liter                                                                               14.0
10 Tostada Shells                                                                     12.0
100% Beeswax Hand Dipped Tapers                                                       13.0
100% Florida Orange Juice                                                             13.0
                                                                                      ...
flings! Original Laundry Detergent Pacs                                               13.0
for All Mouth Sores Fresh Mint Oral Debriding Agent/Antiseptic Rinse/Pain Reliever    13.5
iChef Casserole Pans with Lids (10 7/16 in x 8 in x 1 3/4 in)                         13.0
o.b Super Plus Fluid Lock Tampons                                                     12.0
vitaminwater XXX Acai Blueberry Pomegranate                                          13.0
Name: order_hour_of_day, Length: 1850, dtype: float64

In [66]:
# Sort the results in descending order based on value
pop_prod_median_sorted = pop_products_median_hour.sort_values(ascending=False)
pop_prod_median_sorted

product_name
Scotch Kids 5\" Scissors, Blunted, Red           21.0
Milk Chocolate Truffle Brle                    20.5
Double Garlic Ginger and Lime Marinade           20.0
Awapuhi Volumizing Conditioner                   20.0
Special K Chocolate Caramel Protein Meal Bar     19.0
                                                 ...
Gluten Free Ancient Grain Aged Cheddar Crisps     9.0
Aerosol Powder Dry Antiperspirant & Deodorant     8.5
Seasoning, Blackened                              8.5
Egg Noodles, Toasted Barley Shape                 8.0
Cola, Agave                                       5.0
Name: order_hour_of_day, Length: 1850, dtype: float64

Create a new dataframe for the popular products with columns:

- product_id (and product_name)
- mean order_hour_of_day (and/or mode)
- value_counts

In [80]:
# Different way of getting counts
pop_products_count_sorted = popular_products_orders["product_id"].groupby([popular_products_orders["product_name"]]).count().sort_values(ascending=False)
pop_products_count_sorted

product_name
100% Raw Coconut Water                              39271
100% Recycled Paper Towels                          29047
Organic Red Radish, Bunch                           28267
Creamy Peanut Butter                                21024
Organic Broccoli Crowns                             19145
                                                    ...
Liqui-Kelp Daily Iodine                                 2
Natural Goodness Chicken 100% Fat Free RTS Broth        2
Cola, Agave                                             2
Organic Better Rest Tea Blend                           1
Vitamin D Gummies                                       1
Name: product_id, Length: 1850, dtype: int64

In [82]:
# Trying to join up the two tables I need:
# pop_prod_median_sorted with pop_products_count_sorted
popular_merged = pd.merge(pop_products_mean_hour, pop_products_count_sorted, how="left", on="product_name")
popular_merged.head()

                                 order_hour_of_day  product_id
product_name
0% Fat Blueberry Greek Yogurt            12.856618         544
1 Liter                                  13.696120        4278
10 Tostada Shells                        12.545455          22
100% Beeswax Hand Dipped Tapers          12.400000          35
100% Florida Orange Juice                13.290070        1279

In [83]:
# Rename the column to what it actually shows
popular_merged = popular_merged.rename(columns={"product_id": "count"})

In [87]:
popular_mean_hour_counts = popular_merged.sort_values(by=["order_hour_of_day", "count"], ascending=False)
popular_mean_hour_counts.head()

                                              order_hour_of_day  count
product_name
Milk Chocolate Truffle Brle                         20.500000      2
Risin' Raisin Ancient Grains Cereal                   19.000000      6
Mandarin Mango Hand Soap                              18.750000      4
Tart Cherry Scones                                    18.333333      3
Special K Chocolate Caramel Protein Meal Bar          18.250000      4

In [95]:
# Maybe some sort of crosstabulation or melt or pivot table would make this work
# First, trying a tidy table - and this time I want to group by time of day
# this time I'm also trying out two columns in the groupby() method
pop_products_hour_counts_sorted = popular_products_orders["product_name"].groupby([popular_products_orders["order_hour_of_day"], popular_products_orders["product_name"]]).count().sort_values(ascending=False)
pop_products_hour_counts_sorted.head(16)

order_hour_of_day  product_name
14                 100% Raw Coconut Water        3280
13                 100% Raw Coconut Water        3262
15                 100% Raw Coconut Water        3206
11                 100% Raw Coconut Water        3134
16                 100% Raw Coconut Water        3099
10                 100% Raw Coconut Water        3095
12                 100% Raw Coconut Water        2956
9                  100% Raw Coconut Water        2912
17                 100% Raw Coconut Water        2662
15                 Organic Red Radish, Bunch     2467
14                 Organic Red Radish, Bunch     2401
13                 Organic Red Radish, Bunch     2395
10                 100% Recycled Paper Towels    2391
14                 100% Recycled Paper Towels    2383
11                 Organic Red Radish, Bunch     2346
                   100% Recycled Paper Towels    2338
Name: product_name, dtype: int64

In [101]:
pop_products_hour_counts_sorted = popular_products_orders.groupby([popular_products_orders["order_hour_of_day"], popular_products_orders["product_name"]]).count().sort_values(by=["product_name", "order_hour_of_day"], ascending=False)
pop_products_hour_counts_sorted.head(32)  # A similar table to what I could get with crosstab - potentially useful

,,order_id,product_id,popular
order_hour_of_day,product_name,,,
23,vitaminwater XXX Acai Blueberry Pomegranate,20,20,20
22,vitaminwater XXX Acai Blueberry Pomegranate,34,34,34
21,vitaminwater XXX Acai Blueberry Pomegranate,27,27,27
20,vitaminwater XXX Acai Blueberry Pomegranate,55,55,55
19,vitaminwater XXX Acai Blueberry Pomegranate,88,88,88
18,vitaminwater XXX Acai Blueberry Pomegranate,107,107,107
17,vitaminwater XXX Acai Blueberry Pomegranate,115,115,115
16,vitaminwater XXX Acai Blueberry Pomegranate,169,169,169
15,vitaminwater XXX Acai Blueberry Pomegranate,165,165,165
14,vitaminwater XXX Acai Blueberry Pomegranate,139,139,139
13,vitaminwater XXX Acai Blueberry Pomegranate,140,140,140
12,vitaminwater XXX Acai Blueberry Pomegranate,152,152,152
11,vitaminwater XXX Acai Blueberry Pomegranate,133,133,133
10,vitaminwater XXX Acai Blueberry Pomegranate,171,171,171
9,vitaminwater XXX Acai Blueberry Pomegranate,160,160,160
8,vitaminwater XXX Acai Blueberry Pomegranate,92,92,92
7,vitaminwater XXX Acai Blueberry Pomegranate,34,34,34
6,vitaminwater XXX Acai Blueberry Pomegranate,6,6,6
5,vitaminwater XXX Acai Blueberry Pomegranate,4,4,4
4,vitaminwater XXX Acai Blueberry Pomegranate,3,3,3
3,vitaminwater XXX Acai Blueberry Pomegranate,5,5,5
2,vitaminwater XXX Acai Blueberry Pomegranate,6,6,6
1,vitaminwater XXX Acai Blueberry Pomegranate,6,6,6
0,vitaminwater XXX Acai Blueberry Pomegranate,13,13,13
21,o.b Super Plus Fluid Lock Tampons,2,2,2
20,o.b Super Plus Fluid Lock Tampons,5,5,5
19,o.b Super Plus Fluid Lock Tampons,1,1,1
18,o.b Super Plus Fluid Lock Tampons,2,2,2
17,o.b Super Plus Fluid Lock Tampons,2,2,2
16,o.b Super Plus Fluid Lock Tampons,2,2,2
15,o.b Super Plus Fluid Lock Tampons,3,3,3
14,o.b Super Plus Fluid Lock Tampons,3,3,3

In [72]:
# Now I'll need to count how many of each product is ordered and sort the result by hour of the day

In [53]:
ct_hour_count = pd.crosstab(popular_products_orders["order_hour_of_day"], popular_products_orders["product_name"])
ct_hour_count

product_name,0% Fat Blueberry Greek Yogurt,1 Liter,10 Tostada Shells,100% Beeswax Hand Dipped Tapers,100% Florida Orange Juice,100% Grapeseed Oil,100% Italian Organic Extra Virgin Olive Oil,100% Juice Cranberry,100% Juice No Added Sugar Orange Tangerine,100% Natural Coconut Water,...,Yopa! Greek Nonfat Yogurt With Lowfat Granola & Strawberries,Yorkshire Gold Black Tea,Yotoddler Organic Pear Spinach Mango Yogurt,Yuba Tofu Skin,Zero Calorie Lemonade Strawberry Lemonade,flings! Original Laundry Detergent Pacs,for All Mouth Sores Fresh Mint Oral Debriding Agent/Antiseptic Rinse/Pain Reliever,iChef Casserole Pans with Lids (10 7/16 in x 8 in x 1 3/4 in),o.b Super Plus Fluid Lock Tampons,vitaminwater XXX Acai Blueberry Pomegranate
order_hour_of_day,,,,,,,,,,,,,,,,,,,,,
0,4,33,0,1,20,2,0,0,0,0,...,0,0,49,2,0,0,0,0,0,13
1,2,20,0,0,4,1,0,0,0,0,...,0,1,20,2,0,0,0,0,1,6
2,2,15,0,0,11,0,0,0,0,0,...,0,0,8,0,0,0,0,0,0,6
3,1,7,1,0,5,0,0,0,0,0,...,0,0,11,1,0,0,0,0,0,5
4,1,7,0,0,5,0,0,0,0,0,...,0,0,7,0,0,0,0,0,0,3
5,1,20,0,0,6,2,0,3,0,0,...,0,1,18,0,0,0,0,0,0,4
6,9,39,1,0,11,3,0,1,0,0,...,0,3,72,1,0,0,0,0,1,6
7,32,118,1,1,34,7,1,1,0,2,...,0,4,239,4,0,1,0,0,1,34
8,33,199,0,2,64,9,0,0,2,1,...,0,8,442,9,0,0,1,1,5,92
9,52,296,0,3,81,18,1,1,0,12,...,1,13,490,11,0,0,0,1,6,160
10,43,289,2,5,94,22,2,0,0,8,...,3,17,465,12,0,1,2,3,5,171
11,47,334,5,3,123,26,1,1,1,10,...,1,25,452,18,1,1,3,0,3,133
12,32,347,2,2,103,32,3,4,3,6,...,0,17,426,17,0,1,1,1,4,152
13,40,315,3,3,98,21,5,1,4,2,...,0,20,500,18,0,3,1,3,4,140
14,50,342,0,6,106,25,3,0,5,4,...,4,27,514,20,0,0,1,1,3,139
15,42,340,3,1,111,23,8,1,4,6,...,3,13,483,18,1,1,1,1,3,165
16,44,351,1,2,90,19,1,2,3,5,...,2,22,414,14,1,2,1,0,2,169
17,32,321,0,4,85,12,0,2,2,10,...,5,23,320,10,0,1,1,1,2,115
18,22,300,1,1,64,20,1,0,5,2,...,3,11,312,6,2,0,2,1,2,107
19,14,225,0,0,49,14,1,1,0,4,...,1,5,266,4,0,0,0,1,1,88
20,12,137,1,0,35,13,1,0,1,1,...,1,8,242,0,0,1,1,0,5,55
21,10,81,0,1,38,6,0,0,0,3,...,1,6,229,2,0,0,0,0,2,27
22,12,89,0,0,22,7,1,0,0,2,...,2,2,161,1,0,0,0,0,0,34
23,7,53,1,0,20,1,0,0,0,1,...,0,2,97,3,0,0,1,0,0,20

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####